module.exports = {
  root: true,
  env: {
    browser: true,
    node: true,
  },
  parserOptions: {
    parser: 'babel-eslint',
  },
  extends: [
    'eslint:recommended',
    'plugin:vue/recommended',
  ],
  plugins: [
    'vue',
  ],
  rules: {
    // -------------------------------------------------------------------------
    // Правила для eslint
    // -------------------------------------------------------------------------

    'no-extra-semi': 'off',

    // -------------------------------------------------------------------------
    // Правила для eslint-plugin-vue
    // -------------------------------------------------------------------------

    /**
     * Следующие 2 правила отключены для возможности использовать длинный
     * синтаксис v-bind и v-on
     */
    'vue/v-bind-style': 'off',
    'vue/v-on-style': 'off',

    /**
     * Правило отключено для удобства работы со страницами и компонентами в
     * Nuxt, т.к. страницы должны быть в kebab-case
     */
    'vue/name-property-casing': 'off',
  },
};
